# Pandas

In [1]:
import pandas as pd

In [14]:
# define a series 
s1 = pd.Series([3, 7, 4, 8])
s1

0    3
1    7
2    4
3    8
dtype: int64

In [15]:
s2 = pd.Series(['a', 'f', 'g'])
s2

0    a
1    f
2    g
dtype: object

In [16]:
s3 = pd.Series([3.6, 7.2, 18.9])
s3

0     3.6
1     7.2
2    18.9
dtype: float64

In [18]:
d = pd.DataFrame({
    'apples': [2, 3, 8],
    'oranges': [7, 4, 1]
}
)
d

   apples  oranges
0       2        7
1       3        4
2       8        1

In [19]:
data = {
    'apples': [2, 3, 8],
    'oranges': [7, 4, 1]
}

In [21]:
purshases = pd.DataFrame(data)
purshases

   apples  oranges
0       2        7
1       3        4
2       8        1

In [22]:
purshases = pd.DataFrame(data, index=['David', 'Ahmed', 'Ali'])
purshases

       apples  oranges
David       2        7
Ahmed       3        4
Ali         8        1

In [23]:
purshases.loc['Ali']

apples     8
oranges    1
Name: Ali, dtype: int64

In [24]:
purshases.loc['David']

apples     2
oranges    7
Name: David, dtype: int64

In [25]:
purshases.apples

David    2
Ahmed    3
Ali      8
Name: apples, dtype: int64

In [26]:
purshases['apples']

David    2
Ahmed    3
Ali      8
Name: apples, dtype: int64

In [30]:
df = pd.read_csv('../dataset/purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [31]:
df = pd.read_csv('../dataset/purchases.csv', index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [33]:
df = pd.read_json('../dataset/purchases.json')
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [35]:
!pip install pysqlite3

Collecting pysqlite3
  Using cached pysqlite3-0.4.3.tar.gz (40 kB)
Building wheels for collected packages: pysqlite3
  Building wheel for pysqlite3 (setup.py): started
  Building wheel for pysqlite3 (setup.py): finished with status 'done'
  Running setup.py clean for pysqlite3
Failed to build pysqlite3
Installing collected packages: pysqlite3
    Running setup.py install for pysqlite3: started
    Running setup.py install for pysqlite3: finished with status 'done'
Successfully installed pysqlite3

  WARNING: Legacy build of wheel for 'pysqlite3' created no files.
  Command arguments: 'C:\python38\WPy64-3830\python-3.8.3.amd64\python.exe' -u -c 'import sys, setuptools, tokenize; sys.argv[0] = '"'"'C:\\Users\\Motaz Saad\\AppData\\Local\\Temp\\pip-install-8zxu2500\\pysqlite3\\setup.py'"'"'; __file__='"'"'C:\\Users\\Motaz Saad\\AppData\\Local\\Temp\\pip-install-8zxu2500\\pysqlite3\\setup.py'"'"';f=getattr(tokenize, '"'"'open'"'"', open)(__file__);code=f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' bdist_wheel -d 'C:\Users\Motaz Saad\AppData\Local\Temp\pip-wheel-jsxpticy'
  Command output: [use --verbose to show]

In [36]:
import sqlite3
con = sqlite3.connect("../dataset/database.db")

In [39]:
df = pd.read_sql_query("SELECT * FROM purchases", con)
df

    index  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

In [40]:
df = df.set_index('index')
df

        apples  oranges
index
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [41]:
df.to_csv('../dataset/new_purchases.csv')